import { center } from './map.options';
import { PointType } from './types';

import Trident from '../../assets/ukrainecapital.svg';
import PointMarker from '../../assets/map-marker.png';
import ZaporizkaSich from '../../assets/zaporozka-sich.jpg';
import Sanctuaries from '../../assets/sanctuaries.jpg';
import ScythianState from '../../assets/scythian-state.jpg';
import KhortytsiaLabyrinth from '../../assets/khortytsia-labyrinth.jpg';
import Arboretum from '../../assets/arboretum.jpg';
import Protolche from '../../assets/protolche.jpg';
import ShippingMuseum from '../../assets/shipping-museum.jpg';
import Truglav from '../../assets/truglav.jpeg';
import CossackMamaiMonument from '../../assets/cossack-mamai-monument.jpg';

export const points: PointType[] = [
  {
    name: 'Zaporozka Sich historical and cultural complex',
    coords: {
      lat: 47.85737064685984,
      lng: 35.07491932414972,
    },
    marker: PointMarker,
    data: {
      img: ZaporizkaSich,
      address: 'о.Хортиця, вул. Старого редуту 10, Запоріжжя, Запорізька область, 69000',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        'Січ була столицею козацького краю, його  адміністративним, релігійним, діловим та військовим центром. Численні історичні свідчення та народна творчість донесли до нас пам’ять про Хортицьку Січ – одну з перших січей, яка виникла у XVІ ст. під час освоєння козаками Південної України. З Хортицею була пов’язана діяльність перших організаторів козацтва –  Остапа Дашкевича та Дмитра Вишневецького.',
        'Сучасна Хортицька Січ – це узагальнений образ козацьких укріплень с детальним відтворенням влаштування всіх восьми козацьких січей, які існували у XVІ – XVIII ст.  Вона складається з двох частин – Малий кіш (торгове та ремісниче передмістя) та Великий кіш (козацький гарнізон). Усе містечко захищають фортифікаційні укріплення – рів, вал з гостроколом, оборонні вежі.',
      ],
    },
  },
  {
    name: 'Sanctuaries',
    coords: {
      lat: 47.8579377313526,
      lng: 35.073230295455666,
    },
    marker: PointMarker,
    data: {
      img: Sanctuaries,
      address: 'острів Хортіця, Запоріжжя, Запорізька область, 69000',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        'З давніх-давен хортицькі кручі вабили до себе людей, які надавали цьому місцю особливого, сакрального значення. Не дивно, що на острові збереглися унікальні культові комплекси різних епох. Вік деяких з них набагато перевищує вік всесвітньо відомих єгипетських пірамід. Ці кам’яні споруди використовувались під час релігійних ритуалів, поховальних обрядів та для спостереження за рухом небесних світил.',
        'Тут у великій кількості сконцентрувалися археологічні об’єкти різних часів – курганні і безкурганні поховальні комплекси, численні кам’яні культові споруди, стародавні поселення і городища. Все це ще раз підтверджує духовне, сакральне призначення острова Хортиця – це був своєрідний духовний центр, який об’єднав в собі різні епохи, народності і культури. Серед найвідоміших культових споруд Хортиці комплекс кромлехів доби енеоліту, святилище-обсерваторія, святилище доби бронзи, святилище Каракайка, комплекс ямної культури Генералка 2.',
      ],
    },
  },
  {
    name: 'Scythian state',
    coords: {
      lat: 47.81275972711987,
      lng: 35.11287374014729,
    },
    marker: PointMarker,
    data: {
      img: ScythianState,
      address: 'ул. Заповедная, Запоріжжя, Запорізька область, 69017',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        'Ще на початку XX століття на Хортиці налічувалось 129 курганів різних історичних епох. До наших днів вціліло лише 28. Розташовувалися кургани кількома групами на узбіччі шляху, що колись проходив Хортицею у середній, підвищеній її частині. Наприкінці 2005 року, в найвищій точці острова, з якої відкривається чудовий краєвид, розпочалося облаштування туристично-меморіального комплексу «Скіфський стан» («Зорова Могила»).',
        'На території, що сягає близько п’яти гектарів, зараз можна побачити 11 курганів: поновлених «живих», реконструйованих та стилізованих. Доповнює комплекс масштабний лапідарій – зібрання стародавніх кам’яних витворів: скульптур, стел, хрестів, жорен, гарманів і ступ.',
      ],
    },
  },
  {
    name: 'Khortytsia labyrinth',
    coords: {
      lat: 47.85977165421714,
      lng: 35.06258685030032,
    },
    marker: PointMarker,
    data: {
      img: KhortytsiaLabyrinth,
      address: 'Арочний міст, Запоріжжя, Запорізька область, 69000',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        '«Хортицький лабіринт». Знаходиться у північно-західній частині острова. Це своєрідна паркова зона, утворена мережею перехресних алей з різних видів рослинності, що відображено у назвах: Дубова, Кленова,Тамариксова, Липова, Горіхова, Катальпова, Караганова алеї з мальовничими деревинно-чагарниковими композиціями. Поміж тінистих алей розташовані цінні історичні та археологічні об’єкти. Тут знаходяться святилище доби бронзи, скіфська пам’ятка археології – висота «Канфарка», імовірний цвинтар запорозьких козаків, кладовище та редути часів Російсько-турецької війни 1735 – 1739 рр. Прогулянка «Лабіринтом» принесе задоволення і відпочинок від перебування у тиші хортицького лісу і надасть можливість доторкнутися до історії стародавнього острова.',
      ],
    },
  },
  {
    name: 'Arboretum',
    coords: {
      lat: 47.83004762407675,
      lng: 35.08220102512254,
    },
    marker: PointMarker,
    data: {
      img: Arboretum,
      address: 'Zaporizhzhia, Zaporizhia Oblast, 69061',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        'Дендропарк. Парк гармонійно розташувався поруч з мальовничою балкою Ганнівка, а з його оглядових майданчиків можна милуватися краєвидами Нового русла Дніпра. Закладений в середині минулого століття, він поєднав велике розмаїття декоративних деревинно-чагарникових рослин не порушивши при цьому гармонії краєвидів, найбільш вигідно підкреслив архітектурні композиції та пейзажі.',
      ],
    },
  },
  {
    name: 'Protolche',
    coords: {
      lat: 47.79230756791437,
      lng: 35.1424895221127,
    },
    marker: PointMarker,
    data: {
      img: Protolche,
      address: 'ул. Заповедная, Запоріжжя, Запорізька область, 69017',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        'Знаходиться в південній частині острова, у зоні абсолютної заповідності. Тут відбувається інтенсивний процес відновлення історичного ландшафту. Понад тисячу років тому на цьому місці розташовувалось давньоруське поселення Протовче, згадуване у літописах.',
        'Навкруги – чудові краєвиди плавнів: заквітчані лілеями тихі озера, буяє зеленню плавневий ліс з його осокорами, вербами, тополями, дубами. Багато гарних і рідкісних рослин, різновиддя птахів і тварин.',
      ],
    },
  },
  {
    name: 'Shipping Museum',
    coords: {
      lat: 47.79989188445637,
      lng: 35.134930206407034,
    },
    marker: PointMarker,
    data: {
      img: ShippingMuseum,
      address: 'ул. Заповедная, 23, Запоріжжя, Запорізька область, 69017',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        'Територія Подніпров’я і зокрема о. Хортиця були свідками безлічі вагомих історичних подій. Однією з яскравих сторінок XVIII століття на наших землях була була російсько-турецька війна 1736-1739 рр.  Цим пояснюється наявність великої кількості затоплених човнів біля берегів Хортиці: під час першої російсько-турецької війни кораблі російської ескадри не змогли пройти через дніпровські пороги до Чорного моря та були затоплені. Починаючи з 1999 р. кораблі почали піднімати з дна Дніпра та вдихати в них життя – вже як в музейні експонати.',
        'Тут можна дізнатись про Козацький човен 1736-1739 рр., Дніпровську дюбель-шлюпку 1737 р., Бригантину 1736-1739 рр. – військові судна XVIII століття, Байдак XIX століття – вантажне судно, човен-довбанку тощо. А також на вас чекає найбільша колекція якорів в Україні, яка налічує близько сотні експонатів. Найдавніші з них датуються Х століттям.',
      ],
    },
  },
  {
    name: 'Monument to the Cossack Mamai',
    coords: {
      lat: 47.84158074455956,
      lng: 35.07409433837207,
    },
    marker: PointMarker,
    data: {
      img: CossackMamaiMonument,
      address: 'Zaporizhzhia, Zaporizhia Oblast, 69000',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        "У 2009 році на Хортиці, в районі найбільшої на острові транспортної розв'язки, була встановлена гранітна скульптура козака Мамая - одного з найпопулярніших в Україні образів і народних символів. Мамай уособлює ідеалізований образ козака-лицаря, і зустрічається в народному фольклорі ще з середини XVIII століття, як серед легенд, дум і оповідань, так і на картинах художників. Саме художній образ козака Мамая став найбільш популярним, причому деякий час він був настільки важливим і невід'ємним символом української культури, що конкурував за популярністю з іконами.",
        'Символічний народний образ козака Мамая відмінно доповнив атмосферу острова Хортиця, пам\'ятник швидко полюбився місцевим мешканцям. Більшість масових заходів і зустрічей на Хортиці починаються саме біля пам\'ятника бандуристу - він став прекрасним орієнтиром для всіх гостей острова. У місцевому велорусі скульптуру практично відразу прозвали ВелоБуддою - на "паломництво" до Мамаю практично кожен день в теплу пору року з\'їжджаються велосипедисти з усього міста, тут вони збираються разом і починають спільні "покатушки" по острову.',
      ],
    },
  },
  {
    name: 'Truglav',
    coords: {
      lat: 47.85023887887131,
      lng: 35.075483024217874,
    },
    marker: PointMarker,
    data: {
      img: Truglav,
      address: 'Zaporizhzhia, Zaporizhia Oblast, 69061',
      website_url: 'https://ostriv.org',
      phone: '095 914 7706',
      description: [
        'Язичницьке дерев\'яне святилище, розташоване на північному схилі балки Велика Молодняга. Сучасне святилище має форму корабля. Розташування дерев\'яних фігур богів, згідно пантеону князя Володимира в "Повісті минулих літ" наступне. З південного боку розташований Білобог, з північної - Чорнобог; основний Триглав – Перун (по середині), Дажбог (праворуч), Мокоша (ліворуч), перед ними - Собака Симаргл (ніс корабля вказує на схід).',
        'У самому центрі святилища розташована Треба - колона для жертвопринесення, що символізує усічену щоглу корабля - це Стрибог, Бог Вітрів. У західній частині святилища розташована корма – Хорс у вигляді прямокутної споруди з колод з образами вовків з чотирьох сторін, далі за ним – місце для кормового. На західному вході на святилище розташований Ключник з щілиною для сокири-ключа, і Цур-охоронець з мечем.',
      ],
    },
  },
];

export const centralPoint = {
  name: 'Khortytsia',
  coords: center,
  marker: Trident,
  link: 'https://www.rada.gov.ua/en',
} as PointType;
