export type Translations = {
  uk: {
    [key: string]: string;
  };
};

export type Language = keyof Translations;

export const translations: Translations = {
  uk: {
    'point1.name': 'Запорозька Січ',
    'point1.data.address':
      'о.Хортиця, вул. Старого редуту 10, Запоріжжя, Запорізька область, 69000',
    'point1.data.description': [
      'Січ була столицею козацького краю, його  адміністративним, релігійним, діловим та військовим центром. Численні історичні свідчення та народна творчість донесли до нас пам’ять про Хортицьку Січ – одну з перших січей, яка виникла у XVІ ст. під час освоєння козаками Південної України. З Хортицею була пов’язана діяльність перших організаторів козацтва –  Остапа Дашкевича та Дмитра Вишневецького.',
      'Сучасна Хортицька Січ – це узагальнений образ козацьких укріплень с детальним відтворенням влаштування всіх восьми козацьких січей, які існували у XVІ – XVIII ст.  Вона складається з двох частин – Малий кіш (торгове та ремісниче передмістя) та Великий кіш (козацький гарнізон). Усе містечко захищають фортифікаційні укріплення – рів, вал з гостроколом, оборонні вежі.',
    ].join('\n\n'),
    'point2.name': 'Святилища',
    'point2.data.address': 'острів Хортіця, Запоріжжя, Запорізька область, 69000',
    'point2.data.description': [
      'З давніх-давен хортицькі кручі вабили до себе людей, які надавали цьому місцю особливого, сакрального значення. Не дивно, що на острові збереглися унікальні культові комплекси різних епох. Вік деяких з них набагато перевищує вік всесвітньо відомих єгипетських пірамід. Ці кам’яні споруди використовувались під час релігійних ритуалів, поховальних обрядів та для спостереження за рухом небесних світил.',
      'Тут у великій кількості сконцентрувалися археологічні об’єкти різних часів – курганні і безкурганні поховальні комплекси, численні кам’яні культові споруди, стародавні поселення і городища. Все це ще раз підтверджує духовне, сакральне призначення острова Хортиця – це був своєрідний духовний центр, який об’єднав в собі різні епохи, народності і культури. Серед найвідоміших культових споруд Хортиці комплекс кромлехів доби енеоліту, святилище-обсерваторія, святилище доби бронзи, святилище Каракайка, комплекс ямної культури Генералка 2.',
    ].join('\n\n'),
    'point3.name': 'Скіфський стан',
    'point3.data.address': 'ул. Заповедная, Запоріжжя, Запорізька область, 69017',
    'point3.data.description': [
      'Ще на початку XX століття на Хортиці налічувалось 129 курганів різних історичних епох. До наших днів вціліло лише 28. Розташовувалися кургани кількома групами на узбіччі шляху, що колись проходив Хортицею у середній, підвищеній її частині. Наприкінці 2005 року, в найвищій точці острова, з якої відкривається чудовий краєвид, розпочалося облаштування туристично-меморіального комплексу «Скіфський стан» («Зорова Могила»).',
      'На території, що сягає близько п’яти гектарів, зараз можна побачити 11 курганів: поновлених «живих», реконструйованих та стилізованих. Доповнює комплекс масштабний лапідарій – зібрання стародавніх кам’яних витворів: скульптур, стел, хрестів, жорен, гарманів і ступ.',
    ].join('\n\n'),
    'point4.name': 'Хортицький лабіринт',
    'point4.data.address': 'Арочний міст, Запоріжжя, Запорізька область, 69000',
    'point4.data.description': [
      '«Хортицький лабіринт». Знаходиться у північно-західній частині острова. Це своєрідна паркова зона, утворена мережею перехресних алей з різних видів рослинності, що відображено у назвах: Дубова, Кленова,Тамариксова, Липова, Горіхова, Катальпова, Караганова алеї з мальовничими деревинно-чагарниковими композиціями. Поміж тінистих алей розташовані цінні історичні та археологічні об’єкти. Тут знаходяться святилище доби бронзи, скіфська пам’ятка археології – висота «Канфарка», імовірний цвинтар запорозьких козаків, кладовище та редути часів Російсько-турецької війни 1735 – 1739 рр. Прогулянка «Лабіринтом» принесе задоволення і відпочинок від перебування у тиші хортицького лісу і надасть можливість доторкнутися до історії стародавнього острова.',
    ].join('\n\n'),
    'point5.name': 'Дендропарк',
    'point5.data.address': 'Запоріжжя, Запорізька область, 69061',
    'point5.data.description': [
      'Дендропарк. Парк гармонійно розташувався поруч з мальовничою балкою Ганнівка, а з його оглядових майданчиків можна милуватися краєвидами Нового русла Дніпра. Закладений в середині минулого століття, він поєднав велике розмаїття декоративних деревинно-чагарникових рослин не порушивши при цьому гармонії краєвидів, найбільш вигідно підкреслив архітектурні композиції та пейзажі.',
    ].join('\n\n'),
    'point6.name': 'Протовче',
    'point6.data.address': 'ул. Заповедная, Запоріжжя, Запорізька область, 69017',
    'point6.data.description': [
      'Знаходиться в південній частині острова, у зоні абсолютної заповідності. Тут відбувається інтенсивний процес відновлення історичного ландшафту. Понад тисячу років тому на цьому місці розташовувалось давньоруське поселення Протовче, згадуване у літописах.',
      'Навкруги – чудові краєвиди плавнів: заквітчані лілеями тихі озера, буяє зеленню плавневий ліс з його осокорами, вербами, тополями, дубами. Багато гарних і рідкісних рослин, різновиддя птахів і тварин.',
    ].join('\n\n'),
    'point7.name': 'Музей судноплавства',
    'point7.data.address': 'ул. Заповедная, 23, Запоріжжя, Запорізька область, 69017',
    'point7.data.description': [
      'Територія Подніпров’я і зокрема о. Хортиця були свідками безлічі вагомих історичних подій. Однією з яскравих сторінок XVIII століття на наших землях була була російсько-турецька війна 1736-1739 рр.  Цим пояснюється наявність великої кількості затоплених човнів біля берегів Хортиці: під час першої російсько-турецької війни кораблі російської ескадри не змогли пройти через дніпровські пороги до Чорного моря та були затоплені. Починаючи з 1999 р. кораблі почали піднімати з дна Дніпра та вдихати в них життя – вже як в музейні експонати.',
      'Тут можна дізнатись про Козацький човен 1736-1739 рр., Дніпровську дюбель-шлюпку 1737 р., Бригантину 1736-1739 рр. – військові судна XVIII століття, Байдак XIX століття – вантажне судно, човен-довбанку тощо. А також на вас чекає найбільша колекція якорів в Україні, яка налічує близько сотні експонатів. Найдавніші з них датуються Х століттям.',
    ].join('\n\n'),
    'point8.name': "Пам'ятник козаку Мамаю",
    'point8.data.address': 'Запоріжжя, Запорізька область, 69000',
    'point8.data.description': [
      "У 2009 році на Хортиці, в районі найбільшої на острові транспортної розв'язки, була встановлена гранітна скульптура козака Мамая - одного з найпопулярніших в Україні образів і народних символів. Мамай уособлює ідеалізований образ козака-лицаря, і зустрічається в народному фольклорі ще з середини XVIII століття, як серед легенд, дум і оповідань, так і на картинах художників. Саме художній образ козака Мамая став найбільш популярним, причому деякий час він був настільки важливим і невід'ємним символом української культури, що конкурував за популярністю з іконами.",
      'Символічний народний образ козака Мамая відмінно доповнив атмосферу острова Хортиця, пам\'ятник швидко полюбився місцевим мешканцям. Більшість масових заходів і зустрічей на Хортиці починаються саме біля пам\'ятника бандуристу - він став прекрасним орієнтиром для всіх гостей острова. У місцевому велорусі скульптуру практично відразу прозвали ВелоБуддою - на "паломництво" до Мамаю практично кожен день в теплу пору року з\'їжджаються велосипедисти з усього міста, тут вони збираються разом і починають спільні "покатушки" по острову.',
    ].join('\n\n'),
    'point9.name': 'Триголов',
    'point9.data.address': 'Запоріжжя, Запорізька область, 69061',
    'point9.data.description': [
      'Язичницьке дерев\'яне святилище, розташоване на північному схилі балки Велика Молодняга. Сучасне святилище має форму корабля. Розташування дерев\'яних фігур богів, згідно пантеону князя Володимира в "Повісті минулих літ" наступне. З південного боку розташований Білобог, з північної - Чорнобог; основний Триглав – Перун (по середині), Дажбог (праворуч), Мокоша (ліворуч), перед ними - Собака Симаргл (ніс корабля вказує на схід).',
      'У самому центрі святилища розташована Треба - колона для жертвопринесення, що символізує усічену щоглу корабля - це Стрибог, Бог Вітрів. У західній частині святилища розташована корма – Хорс у вигляді прямокутної споруди з колод з образами вовків з чотирьох сторін, далі за ним – місце для кормового. На західному вході на святилище розташований Ключник з щілиною для сокири-ключа, і Цур-охоронець з мечем.',
    ].join('\n\n'),
  },
};
